```data.archive_file.app_zip: Reading...
data.archive_file.libs_zip: Reading...
data.archive_file.app_zip: Read complete after 0s [id=b4f1ff1a8dece0ed59221194a68b3b06d8e77933]
data.aws_caller_identity.current: Reading...
data.aws_region.current: Reading...
data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
aws_s3_bucket.RequestLogBucket: Refreshing state... [id=throwtrash-skill-request-logs-ap-northeast-1]
aws_s3_bucket.PreferenceBucket: Refreshing state... [id=throwtrash-skill-preference-ap-northeast-1]
data.aws_caller_identity.current: Read complete after 0s [id=188970983837]
data.archive_file.libs_zip: Read complete after 2s [id=fe7bba6b46f84bfbcc6469557bd6550a24bb6412]
aws_lambda_layer_version.Layer: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-skill-libs:16]
aws_lambda_function.ThrowTrashSkill: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:ThrowTrashSkill]
aws_lambda_permission.LambdaEvent: Refreshing state... [id=ThrowTrashSkill-LambdaEvent-194ELE5T4RTXU]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_policy.LambdaExecPolicy will be created
  + resource "aws_iam_policy" "LambdaExecPolicy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "throwtrash-lambda-policy-ap-northeast-1"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "dynamodb:*"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:dynamodb:ap-northeast-1:188970983837:table/throwtrash-db-schedule",
                          + "arn:aws:dynamodb:ap-northeast-1:188970983837:table/throwtrash-db-accesstoken",
                        ]
                    },
                  + {
                      + Action   = "lambda:*"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:lambda:ap-northeast-1:188970983837:function:ThrowTrashSkill"
                    },
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                          + "s3:GetObject",
                          + "s3:PutObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::throwtrash-skill-preference-ap-northeast-1",
                          + "arn:aws:s3:::throwtrash-skill-preference-ap-northeast-1/*",
                          + "arn:aws:s3:::throwtrash-skill-request-logs-ap-northeast-1",
                          + "arn:aws:s3:::throwtrash-skill-request-logs-ap-northeast-1/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags      = {
          + "app"   = "throwtrash"
          + "group" = "skill"
        }
      + tags_all  = {
          + "app"   = "throwtrash"
          + "group" = "skill"
        }
    }

  # aws_iam_role.LambdaExecRole will be created
  + resource "aws_iam_role" "LambdaExecRole" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "throwtrash-lambda-role-ap-northeast-1"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "app"   = "throwtrash"
          + "group" = "skill"
        }
      + tags_all              = {
          + "app"   = "throwtrash"
          + "group" = "skill"
        }
      + unique_id             = (known after apply)
    }

  # aws_lambda_function.ThrowTrashSkill will be updated in-place
  ~ resource "aws_lambda_function" "ThrowTrashSkill" {
      + filename                       = "./app/app.zip"
        id                             = "arn:aws:lambda:ap-northeast-1:188970983837:function:ThrowTrashSkill"
      ~ last_modified                  = "2023-12-17T02:38:31.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-skill-libs:16",
        ] -> (known after apply)
      + publish                        = false
      ~ role                           = "arn:aws:iam::188970983837:role/throwtrash-lambda-role-ap-northeast-1" -> (known after apply)
      ~ runtime                        = "nodejs16.x" -> "nodejs18.x"
      ~ source_code_hash               = "+JO5KaUk9TmewJRaJX4em3+m7zjOD4i2QtebSI07ZpM=" -> "xuMdHOGusioVs0uXeTbwBkWRif4RmOiuzX6on1ahepM="
      ~ tags                           = {
          - "Group"            = "throwtrash" -> null
          - "Purpose"          = "Skill" -> null
          + "app"              = "throwtrash"
          + "group"            = "skill"
          - "lambda:createdBy" = "SAM" -> null
        }
      ~ tags_all                       = {
          - "Group"            = "throwtrash" -> null
          - "Purpose"          = "Skill" -> null
          + "app"              = "throwtrash"
          + "group"            = "skill"
          - "lambda:createdBy" = "SAM" -> null
        }
        # (12 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "MECAB_API_KEY"       = "KZ0i4QQOku7RCYMHDx1m54Jf4eXpCjy16f83AtXx"
              + "MECAB_API_URL"       = "https://d698010tff.execute-api.ap-northeast-1.amazonaws.com/prod"
              - "MecabAPI_URL"        = "http://140.238.205.11" -> null
              ~ "RUNLEVEL"            = "INFO" -> "DEBUG"
                # (3 unchanged elements hidden)
            }
        }

      - timeouts {}

        # (1 unchanged block hidden)
    }

  # aws_lambda_layer_version.Layer must be replaced
-/+ resource "aws_lambda_layer_version" "Layer" {
      ~ arn                         = "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-skill-libs:16" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ compatible_runtimes         = [ # forces replacement
          - "nodejs16.x",
          + "nodejs18.x",
        ]
      ~ created_date                = "2023-12-17T02:38:13.631+0000" -> (known after apply)
      + filename                    = "./app/libs.zip" # forces replacement
      ~ id                          = "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-skill-libs:16" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-skill-libs" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + skip_destroy                = true # forces replacement
      ~ source_code_hash            = "3BELgV6eadPozMKWNRY3Lq040stFl/ya7HJg9wiN0fI=" -> "uBk22tAW9qb+jYZTptAA5R1wp1bz3vcappNF0VIE438=" # forces replacement
      ~ source_code_size            = 16120860 -> (known after apply)
      ~ version                     = "16" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_lambda_permission.LambdaEvent must be replaced
-/+ resource "aws_lambda_permission" "LambdaEvent" {
      ~ id                 = "ThrowTrashSkill-LambdaEvent-194ELE5T4RTXU" -> (known after apply)
      ~ statement_id       = "ThrowTrashSkill-LambdaEvent-194ELE5T4RTXU" -> "AllowExecutionFromAlexa" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # aws_s3_bucket.PreferenceBucket will be updated in-place
  ~ resource "aws_s3_bucket" "PreferenceBucket" {
      + acl                         = "private"
      + force_destroy               = false
        id                          = "throwtrash-skill-preference-ap-northeast-1"
      ~ tags                        = {
          - "Group"   = "throwtrash" -> null
          - "Purpose" = "Skill" -> null
          + "app"     = "throwtrash"
          + "group"   = "skill"
        }
      ~ tags_all                    = {
          - "Group"   = "throwtrash" -> null
          - "Purpose" = "Skill" -> null
          + "app"     = "throwtrash"
          + "group"   = "skill"
        }
        # (8 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_s3_bucket.RequestLogBucket will be updated in-place
  ~ resource "aws_s3_bucket" "RequestLogBucket" {
      + acl                         = "private"
      + force_destroy               = false
        id                          = "throwtrash-skill-request-logs-ap-northeast-1"
      ~ tags                        = {
          - "Group"   = "throwtrash" -> null
          - "Purpose" = "Skill" -> null
          + "app"     = "throwtrash"
          + "group"   = "skill"
        }
      ~ tags_all                    = {
          - "Group"   = "throwtrash" -> null
          - "Purpose" = "Skill" -> null
          + "app"     = "throwtrash"
          + "group"   = "skill"
        }
        # (8 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_s3_bucket_acl.PreferenceBucketAcl will be created
  + resource "aws_s3_bucket_acl" "PreferenceBucketAcl" {
      + acl    = "private"
      + bucket = "throwtrash-skill-preference-ap-northeast-1"
      + id     = (known after apply)
    }

  # aws_s3_bucket_acl.RequestLogBucketAcl will be created
  + resource "aws_s3_bucket_acl" "RequestLogBucketAcl" {
      + acl    = "private"
      + bucket = "throwtrash-skill-request-logs-ap-northeast-1"
      + id     = (known after apply)
    }

Plan: 6 to add, 3 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now. ```